Tekla Open API Reference for Tekla Structures 2025
RebarMesh.FromPlaneOffset Property
 The offset value from the part surface applied in both sides.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override double FromPlaneOffset { get; set; }
Public Overrides Property FromPlaneOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace